Console.Clear();
/*Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1
Console.WriteLine("Введите трехзначное число:");
int Num = Convert.ToInt32(Console.ReadLine());

int lastNum = Num % 100;

int res = lastNum / 10;

Console.WriteLine($"Вторая цифра в числе {res}" );*/
